English/NCE2/L04 An exciting trip.org
#+OPTIONS: \n:t toc:nil num:nil html-postamble:nil
#+HTML_HEAD_EXTRA: <style>body {background: rgb(193, 230, 198) !important;}</style>
* Lesson 4 An exciting trip
#+begin_verse
Why is Tim finding this trip exciting?

I have just received a letter from my brother, Tim.
He is in Australia.
He has been there for six months.
Tim is an engineer.
He is working for a big firm and he has already visited *a great number of* different places in Australia.
He has just bought an Australian car and *has gone to Alice Springs*, a small town in the centre of Australia.
He will soon visit Darwin.
From there, he will *fly to Perth*.
My brother has never been abroad before, so he is *finding this trip very exciting*.
#+end_verse
** expression
exciting [ɪkˈsaɪtɪŋ] adj.令人兴奋的
receive [rɪˈsiːv] v.接受
firm [fɜːm] n.公司
different [ˈdɪfrənt] adj.不同的
centre [ˈsentə(r)] n.中心
abroad [əˈbrɔːd] adv.国外地

have a great trip: 旅途愉快
receive sth. from sb. 从某人收到某物
work for 为(公司/某人)工作
A be different from B A不同于B
in the centre of sp. 在某地的中央
go abroad 去国外
live abroad 住国外
study abroad 留学

--------------------
have done:
	1. 过去事情对现在有影响;
	2. 从过去持续到现在
	3. 与just~already和yet连用
		just: 刚刚
		already: 早就(预料之前)
		yet: 到目前为止(期待发生,只用疑问和否定句)
	4. 不用过去时间点连用
	5. have gone to 去了那里 & have been to 在那里

receive sth. from sb. 从某人收到某物
work for sb. 为(公司/某人)工作
a great number of 大量+(nc.)
have gone to sp. VS have been to sp. 动身去某地 VS 去过某地
fly to sp. 飞去某地
find n. adj. 发现某物/人怎么样


** words
have a good trip
- I have had a great trip in Shanghai last summer.
- I haven't had a great trip in Shanghai last summer.
- Have you had a great trip in Shanghai last summer.
- Why have you had a great trip in Shanghai last summer?
- When you have had a great trip in Shanghai?
receive sth. from sb.
- I have received a message from my father.
- Have you received a message from your father?
- What have you received from your father?
- Where have you received a letter from your father?
- Why have you received a letter from your father?
work for
- I'm working for Miss Qiu.
- Who are you working for?
- Why are you working for Miss Qiu?
- Are you working for Miss Qiu?
- Where are you working for Miss Qiu?
A be different from B
- I was different from my wife.
- Were you different from your wife?
- Where were you different from your wife?
- Why were you different from your wife?
- Who were you different from?
in the centre of sw.
- He talking loudly in the centre of the theater.
- Was he talking loudly in the centre of the theater?
- Why was he talking loudly in the centre of the theater?
- Who was talking loudly in the centre of the theater?
- What was he talking about loudly in the centre of the theater?
go/live/study abroad
- Miss Feng has already gone abroad.
- Has Miss Feng gone abroad?
- Why has Miss Feng gone abroad?
- Where has Miss Feng gone abroad?
- How long has Miss Feng gone abroad?
** expressions
a great number of
- My wife has visited a great number of different places in China.
- Have you visited a great number of different places in China?
- Why have you visited a great number of different places in China?
- Where have you visited a great number of different places?
have gone to sw.
- I have gone to HangZhou.
- Have you gone to Hangzhou?
- Why have you gone to Hangzhou?
- Where have you gone?
fly to sw.
- I have flew to NanNing.
- Have you flew to Nanning?
- Why did you fly to Nanning?
- When did you fly to Nanning?
find n. adj.
- I find it very beautiful.
- Do you find it beautiful?
- What do you find beautiful?
- Why do you find it beautiful?

** 单词造句
have a great trip
- I have had a great trip in Shanghai last Summer.
- I haven't had a great trip in Shanghai last Summer.
- Have you had a great trip in Shanghai last Summer?
- Why have you had a great trip in Shanghai last Summer?
- When ahve you had a great trip in Shanghai?
receive sth. from sb.
- I have received a message from my father.
- Have you received a message from my father?
- What have you received from your father?
- Where have you received a letter from your father?
- Why have you received a letter from your father?
work for
- I'm working for Miss Qiu.
- Who are you working for?
- Why are you working for Miss Qiu?
- Are you working for Miss Qiu?
- Where are you working for Miss Qiu?
A be different from B
- I am different from my wife.
- Where are you different from your wife?
- Why are you different from your wife?
- Where are you different from your wife?
- Who are you different from in your company?
in the centre of sw.
- He was talking loudly in the centre of the theater.
- Was he talking loudly in theater of the theater?
- Why was he talking loudly in theater of the theater?
- Who was talking loudly in the centre of the theater?
- What was he talking about loudly in the centre of the theater?
go/live/study abroad
- Miss Yan has already gone abroad.
- Has Miss Yan gone abroad?
- Why has Miss Yan gone abroad?
- How long has Miss Yan gone abroad?
- Where has Miss Yan gone abroad?

** 反复听电影片段
** Pattern Drill 写+读
-
		1t: received Tim's letter
		s1: Have you received Tim's letter yet?
		s2: Yes, I've just received it.
	 - washed the dishes
		 Have you washed the dishes?
		 Yes, I've just washed it.
	 - seen the new play
		 Have you seen the new play?
		 Yes, I've just seen it.
	 - made the cakes
		 Have you made the cakes?
		 Yes, I've just made it.
	 - swept the carpet
		 Have you swept the carpet?
		 Yes, I've just swept it.
-
		2t: read the book
		s1: Why don't you read that book?
		s2: Because I've already read it.
	 - see the film
		 Why don't you see the film?
		 Because I've already seen the film.
	 - cut the grass
		 Why don't you cut the grass?
		 Because I've already cut the grass.
	 - write your letter
		 Why don't you write your letter?
		 Because I've already written it.
	 - cook the dinner
		 Why don't you cook the dinner?
		 Because I've already cooked the dinner.
-
		3t: Australia
		s1: He's gone to Australia.
		s2: He's never been there before, has he?
	 - Austria
		 He's gone to Austria.
		 He's never been there before, has he?
	 - Japan
		 He's gone to Japan.
		 He's never been there before, has he?
	 - Brazil
		 He's gone to Brazil.
		 He's never been there before, has he?
	 - the USA
		 He's gone to the USA.
		 He's never been there before, has he?
-
		4t: the train arrived
		s1: Has the train arrived?
		s2: No, it hasn't arrived yet.
	 - the bus left
		 Has the bus left?
		 No, it hasn't left yet.
	 - Alice telephoned
		 Has Alice telephoned?
		 No, he hasn't telephoned yet.
	 - the boss came
		 Has the boss come?
		 No, he hasn't come yet.
	 - the sun set
		 Has the sun set?
		 No, it hasn't set yet.
** 给自己讲解
** 红皮书
** 习惯用法造句
a great many of
- My wife has visited a great number of different places in China.
- Have you visited a great number of different places in China?
- Why have you visited a great number of different places in China?
- Where have you visited a great number of different places in China?
- There are a great many of cities in China.
have gone to sw.
- I have gone to Hangzhou.
- Have you every gone to Hangzhou?
- Why have you gone to Hangzhou?
- Where have you gone?
- He has already gone to Hangzhou.
fly to sw.
- I have flown to Nanning?
- Have you flown to Nanning?
- Why did you fly to Nanning?
- What did you fly to?
- When did you fly to Nanning?
find n. adj.
- I find it very beautiful.
- Do you find it beautiful?
- What do you find beautiful?
- Why do you find it beautiful?
- I found my cat cute when she was asking for meat.
** 跟读至背诵
** Ask me if 写+读
1. I've just received a letter. What
	 What have you just received?
2. It was from my brother, Tim. Who
		Who was it from?
3. He's in Australia. Where/Who
		Where is he?
		Who is in Australia?
4. He's been there for six monthes. How long
		How long has he been there?
5. He's an engineer. What
		What does he do?
6. He's working for a big firm. Who
	 Who's working for a big firm?
7. He's just bought an Australian car. What
	 What has he just bought?
8. He's just gone to Alice Springs. Where
	 Where has he just gone?
9. It's a small town. How big
	 How big is the town?
10. He'll soon visit Darwin. When
		When will he visit Darwin?
** 摘要写作
I've just received a letter from my Brother, Tim.
He's an engineer.
He has been in Australia for six months, he has visited many places.
He has gone to Darwin.
He has never been abroad before, he is enjoying his trip very much.
** tell the story 口语
** Topics for discussion
1. Do you know anyone who lives or works abroad? Tell us about him/her.
2. Which country would you like to visit? Why?
3. Have you got a pen friend? Do you think pen friends are a good idea? Why?
